docs/math/pedagogy.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-d8254e7e-326c-40c6-8b31-8fc0077feb87">1. Principles</a></li>
</ul>
</div>
</div>
<div id="outline-container-h-d8254e7e-326c-40c6-8b31-8fc0077feb87" class="outline-2">
<h2 id="h-d8254e7e-326c-40c6-8b31-8fc0077feb87"><span class="section-number-2">1.</span> Principles</h2>
<div class="outline-text-2" id="text-h-d8254e7e-326c-40c6-8b31-8fc0077feb87">
<p>
<b>Effective Thinking Principle.</b>
<i>Seek Different Views of the Same Result.</i>
Understanding a theorem often resides in the proof rather than
the statement. So alternative proofs provide additional insight—look for
them.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Do Special Cases.</i>
By doing special cases, particularly simple cases, you teach yourself
how to do harder problems.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Understand Simple Things Deeply.</i>
Understanding basic ideas with great depth often leads to great
insights.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Definitions Should Capture Essentials.</i>
After we have isolated essential features of a concept, pin
them down with a definition that contains those essentials and as
little else as possible.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Explore Consequences of Definitions.</i>
After making a definition, identify immediate implications of the
definition in order to understand its meaning.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Create Examples.</i>
When learning any definition in mathematics, one helpful step is to
construct several examples that illustrate the meaning of the definition.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Imagine Alternative Worlds.</i>
One way to create concepts is to imagine our world but with some feature
altered, and then follow the consequences.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Push Analogies.</i>
When using an analogy to
create an idea, see whether the analogy can be refined by looking at
more specific features
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Settle on an Idea and Explore the Consequences.</i>
After identifying essential elements, make a definition
and explore the implications.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Generalizations Should Generalize.</i>
If a definition is intended to generalize a specific example, check to make
certain it does so.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Draw a Picture.</i>
Part of the value of drawing a picture is to see features in your picture
that you did not intentionally put there. For example, if you draw a
triangle without thinking about it, the sum of the angles will equal 180
degrees. A picture can suggest insights that will help with your
argument. Get in the habit of drawing pictures!
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Extending Theorems.</i>
A habit that will help you to understand mathematics is always to look
for the extent to which a theorem can be extended or not.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Borrow Strategies from Other Fields.</i>
Powerful concepts from other fields can inspire new insights either
directly or by analogy
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Consider the Converse.</i>
We can deepen our understanding of a theorem by considering whether or
not the converse is true.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Find Examples to Distinguish Concepts.</i>
We have now been introduced to a collection of new definitions. A good
way to get accustomed to new definitions is to find examples that
manifest the differences in the various properties.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Consider Ideas at Different Scales.</i>
One of the strategies of mathematics is, after conceiving of a property
at some level,to consider whether that same idea could be valuable at a
different scale.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Look for Implications of Definitions.</i>
Sometimes a definition immediately implies an apparently stronger
version or versions of the definition. Seek them out and formulate them.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Explore Limits of Theorems; Add Hypotheses.</i>
When you discover a theorem, explore its limitations and possible
extensions by systematically weakening the hypotheses and checking to see
whether the theorem is still true and strengthening the conclusion to see
whether you can deduce more than you originally thought.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Add a Hypothesis.</i>
When you can’t prove aconjecture, create additional hypotheses that
would allow you to prove it.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Look at Examples to Understand Theorems.</i>
One of the best ways to make a theorem more meaningful is to see its
implications in specific cases.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Consider Related Spaces.</i>
Once you haveproved a theorem for one space, see whether it is true for
related spaces.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Consider Analogies of Previous Results.</i>
After developing variations of previous concepts, look at previous
results and see what analogous results hold.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Weaken Hypotheses if Possible.</i>
To understand theorems better and to improve them if possible, identify
exactly what aspects of the hypotheses were actually used in the proof.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Look at Examples.</i>
After learning new concepts, investigate examples to see how those
properties manifest themselves.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Bring to Mind All Equivalent Formulations.</i>
After learning that a concept has equivalent formulations, get in the
habit of consciously considering each one in order to select the most
convenient option in a given situation.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Ask About Local Versions of Global Concepts.</i>
After defining a concept for a whole space, investigate whether there is
a local version of that concept.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Investigate How Properties are Related by Transformations.</i>
After defining structure-respecting transformations, investigate what
properties are preserved by those functions.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Check the Necessity of Hypotheses.</i>
After you prove a theorem, check that all the hypotheses are necessary.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Understand Proofs, Not Just Statements, of Theorems.</i>
Understanding the proofs of theorems rather than just the statements of
theorems gives you power.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Extend Results.</i>
After proving a theorem, see if it can be improved or modified.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Seek Equivalences.</i>
After isolating a concept or a definition, seek equivalences with the
goal of understanding the idea from different perspectives.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Look at Examples to Make Definitions Meaningful.</i>
After creating or encountering a definition, look at a range of
specific examples to help you understand the definition more deeply.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Connect New Ideas with Old Ideas.</i>
After isolating a new idea, consider previous concepts and constructions
and explore how the new idea relates to them.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Consider Opposite Questions.</i>
When studying a topic, it is often illuminating to consider the opposite
questions.
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Start with Simple Cases.</i>
George Polya said, "If you can't solve a problem, then there is an
easier problem you can’t solve. Find it."
</p>

<p>
<b>Effective Thinking Principle.</b>
<i>Opposite Extremes.</i>
After creating a concept, explore its opposite as well.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Sat, 31 Dec 2022 13:09:19 -0800
</div>
</body>
</html>
